packages/Webkul/Checkout/src/Cart.php

    public function saveShippingMethod(string $shippingMethodCode): bool
    {
        if (! $this->cart) {
            return false;
        }

        if (! Shipping::isMethodCodeExists($shippingMethodCode)) {
            return false;
        }

        $this->cart->shipping_method = $shippingMethodCode;
        $this->cart->save();
---
update `cart` set `shipping_method` = 'free_free', `cart`.`updated_at` = '2026-07-12 04:05:56' where `id` = 2