packages/Webkul/Admin/src/Helpers/Reporting/Customer.php

    public function getTotalCustomers($startDate, $endDate): int
    {
        return $this->customerRepository
            ->resetModel()
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->count();
---
select count(*) as aggregate from `customers` where `channel_id` in (1) and `created_at` between '2026-05-12 00:00:00' and '2026-06-11 00:00:00'

    public function getCustomersWithMostSales($limit = null): Collection
    {
        return $this->orderRepository
            ->resetModel()
            ->addSelect(
                'orders.customer_id as id',
                'orders.customer_email as email',
                DB::raw('CONCAT(orders.customer_first_name, " ", orders.customer_last_name) as full_name'),
                DB::raw('SUM(base_grand_total_invoiced - base_grand_total_refunded) as total'),
                DB::raw('COUNT(*) as orders')
            )
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$this->startDate, $this->endDate])
            ->groupBy(DB::raw('CONCAT(customer_email, "-", customer_id)'))
            ->orderByDesc('total')
            ->limit($limit)
            ->get();
---
select `orders`.`customer_id` as `id`, `orders`.`customer_email` as `email`, CONCAT(orders.customer_first_name, " ", orders.customer_last_name) as full_name, SUM(base_grand_total_invoiced - base_grand_total_refunded) as total, COUNT(*) as orders from `orders` where `channel_id` in (1) and `created_at` between '2026-06-11 00:00:00' and '2026-07-11 04:53:50' group by CONCAT(customer_email, "-", customer_id) order by `total` desc limit 5