packages/Webkul/Admin/src/Helpers/Reporting/Product.php

select *, SUM(qty) as total_qty from `product_inventories` left join `product_channels` on `product_inventories`.`product_id` = `product_channels`.`product_id` where `channel_id` in (1) group by `product_inventories`.`product_id` order by `total_qty` asc limit 5
---
    public function getStockThresholdProducts($limit = null): EloquentCollection
    {
        return $this->productInventoryRepository
            ->resetModel()
            ->with(['product', 'product.attribute_family', 'product.attribute_values', 'product.images'])
            ->leftJoin('product_channels', 'product_inventories.product_id', '=', 'product_channels.product_id')
            ->select('*', DB::raw('SUM(qty) as total_qty'))
            ->whereIn('channel_id', $this->channelIds)
            ->groupBy('product_inventories.product_id')
            ->orderBy('total_qty', 'ASC')
            ->limit($limit)
            ->get();

select *, SUM(base_total_invoiced - base_amount_refunded) as revenue from `order_items` left join `orders` on `order_items`.`order_id` = `orders`.`id` where `parent_id` is null and `channel_id` in (1) and `order_items`.`created_at` between '2026-06-11 00:00:00' and '2026-07-11 06:29:32' group by `product_id` having SUM(base_total_invoiced - base_amount_refunded) > 0 order by `revenue` desc limit 5
---
    public function getTopSellingProductsByRevenue($limit = null): Collection
    {
        $items = $this->orderItemRepository
            ->resetModel()
            ->with(['product', 'product.attribute_family', 'product.attribute_values', 'product.images'])
            ->leftJoin('orders', 'order_items.order_id', '=', 'orders.id')
            ->addSelect('*', DB::raw('SUM(base_total_invoiced - base_amount_refunded) as revenue'))
            ->whereNull('parent_id')
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('order_items.created_at', [$this->startDate, $this->endDate])
            ->having(DB::raw('SUM(base_total_invoiced - base_amount_refunded)'), '>', 0)
            ->groupBy('product_id')
            ->orderBy('revenue', 'DESC')
            ->limit($limit)
            ->get();