packages/Webkul/Admin/src/Helpers/Reporting/Sale.php

select count(*) as aggregate from `orders` where `channel_id` in (1) and `created_at` between '2026-05-12 00:00:00' and '2026-06-11 00:00:00'
---
    public function getTotalOrders($startDate, $endDate): int
    {
        return $this->orderRepository
            ->resetModel()
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->count();

select * from `orders` where `channel_id` in (1) and `orders`.`created_at` between '2026-07-11 00:00:00' and '2026-07-11 23:59:59'
---
    public function getTodayOrders()
    {
        return $this->orderRepository
            ->resetModel()
            ->with(['addresses', 'payment', 'items'])
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('orders.created_at', [now()->today(), now()->endOfDay()])
            ->get();

select sum(base_grand_total_invoiced - base_grand_total_refunded) as aggregate from `orders` where `channel_id` in (1) and `created_at` between '2026-05-12 00:00:00' and '2026-06-11 00:00:00'
---
    public function getTotalSales($startDate, $endDate): float
    {
        return $this->orderRepository
            ->resetModel()
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->sum(DB::raw('base_grand_total_invoiced - base_grand_total_refunded'));

select avg(base_grand_total_invoiced - base_grand_total_refunded) as aggregate from `orders` where `channel_id` in (1) and `created_at` between '2026-05-12 00:00:00' and '2026-06-11 00:00:00'
---
    public function getAverageSales($startDate, $endDate): ?float
    {
        return $this->orderRepository
            ->resetModel()
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->avg(DB::raw('base_grand_total_invoiced - base_grand_total_refunded'));

select DAYOFYEAR(created_at) AS date, SUM(base_grand_total_invoiced - base_grand_total_refunded) AS total, COUNT(*) AS count from `orders` where `channel_id` in (1) and `created_at` between '2026-06-11 00:00:00' and '2026-07-11 11:45:22' group by `date`
---
    public function getOverTimeStats($startDate, $endDate, $valueColumn, $period = 'auto'): array
    {
        $config = $this->getTimeInterval($startDate, $endDate, $period);

        $groupColumn = $config['group_column'];

        $results = $this->orderRepository
            ->resetModel()
            ->select(
                DB::raw("$groupColumn AS date"),
                DB::raw("$valueColumn AS total"),
                DB::raw('COUNT(*) AS count')
            )
            ->whereIn('channel_id', $this->channelIds)
            ->whereBetween('created_at', [$startDate, $endDate])
            ->groupBy('date')
            ->get();