packages/Webkul/Checkout/src/Models/Cart.php

select * from `cart_shipping_rates` where `cart_shipping_rates`.`cart_id` = 2 and `cart_shipping_rates`.`cart_id` is not null
---
    public function getSelectedShippingRateAttribute()
    {
        return $this->selected_shipping_rate()
            ->first();