app/Http/Controllers/AliExpress/AliExpressSyncController.php

select count(*) as aggregate from `aliexpress_product_imports`
select * from `aliexpress_product_imports` order by `updated_at` desc limit 1
---
    public function index(Request $request): View
    {
        $search = $request->query('search', '');

        // 1. Paginated imports
        $query = AliExpressProductImport::with('product')
            ->orderBy('id', 'desc');

        if (! empty($search)) {
            $query->where(function ($q) use ($search) {
                $q->where('aliexpress_product_id', 'like', "%{$search}%")
                    ->orWhere('sku', 'like', "%{$search}%")
                    ->orWhere('product_id', $search);
            });
        }

        $imports = $query->paginate(15, ['*'], 'imports_page')->withQueryString();

        // Calculate statistics for the LAST sync session (within 10 minutes of the latest updated record)
        $latestImport = AliExpressProductImport::orderBy('updated_at', 'desc')->first();

select * from `sync_runs` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `sync_runs`
select count(*) as aggregate from `domain_outbox_events`
---
        }

        // 2. Paginated Sync Runs logs (Sprint 2)
        $syncRuns = SyncRun::orderBy('created_at', 'desc')
            ->paginate(10, ['*'], 'runs_page')
            ->withQueryString();

        // 3. Paginated Outbox Events (Sprint 2)
        $outboxEvents = DB::table('domain_outbox_events')
            ->orderBy('id', 'desc')
            ->paginate(10, ['*'], 'outbox_page')
            ->withQueryString();

select count(*) as aggregate from `external_inbox_events`
---
        }

        // 4. Paginated Inbox Events (Sprint 2)
        $inboxEvents = DB::table('external_inbox_events')
            ->orderBy('id', 'desc')
            ->paginate(10, ['*'], 'inbox_page')
            ->withQueryString();