app/Services/AliExpress/Shipping/AliExpressShipping.php

    protected function shippingForCartItem($item): ?AliExpressProductImport
    {
        $productIds = array_values(array_filter([
            $item->product_id,
            $item->product?->parent_id,
            $item->additional['product_id'] ?? null,
        ]));

        if ($productIds === []) {
            return null;
        }

        return AliExpressProductImport::query()
            ->whereIn('product_id', $productIds)
            ->whereNotNull('base_shipping_cost')
            ->orderByRaw('product_id = ? DESC', [$item->product_id])
            ->first();
---
select * from `aliexpress_product_imports` where `product_id` in (23, '23') and `base_shipping_cost` is not null order by product_id = 23 DESC limit 1