app/Services/AliExpress/AliExpressOAuthService.php

select * from `aliexpress_tokens` order by `id` desc limit 1
---
    public function latestToken(): ?AliExpressToken
    {
        $token = AliExpressToken::query()->latest('id')->first();