packages/Webkul/Admin/src/DataGrids/Catalog/ProductDataGrid.php

    protected function formatRecords($records): mixed
    {
        $records = parent::formatRecords($records);

        foreach ($records as $record) {
            $record->variants = [];

            if ($record->type === 'configurable') {
                $tablePrefix = DB::getTablePrefix();

                $variants = DB::table('product_flat')
                    ->leftJoin('product_images', 'product_flat.product_id', '=', 'product_images.product_id')
                    ->leftJoin('product_inventories', 'product_flat.product_id', '=', 'product_inventories.product_id')
                    ->select(
                        'product_flat.product_id',
                        'product_flat.sku',
                        'product_flat.name',
                        'product_flat.price',
                        'product_flat.status',
                        'product_flat.type',
                        'product_images.path as base_image'
                    )
                    ->addSelect(DB::raw('SUM(DISTINCT '.$tablePrefix.'product_inventories.qty) as quantity'))
                    ->where('product_flat.parent_id', $record->product_id)
                    ->where('product_flat.locale', app()->getLocale())
                    ->groupBy('product_flat.product_id')
                    ->get();
---
select `product_flat`.`product_id`, `product_flat`.`sku`, `product_flat`.`name`, `product_flat`.`price`, `product_flat`.`status`, `product_flat`.`type`, `product_images`.`path` as `base_image`, SUM(DISTINCT product_inventories.qty) as quantity from `product_flat` left join `product_images` on `product_flat`.`product_id` = `product_images`.`product_id` left join `product_inventories` on `product_flat`.`product_id` = `product_inventories`.`product_id` where `product_flat`.`parent_id` = 23 and `product_flat`.`locale` = 'ar' group by `product_flat`.`product_id`