packages/Webkul/Shipping/src/Shipping.php

delete from `cart_shipping_rates` where `cart_shipping_rates`.`cart_id` = 2 and `cart_shipping_rates`.`cart_id` is not null
---
    public function removeAllShippingRates()
    {
        if (! $cart = Cart::getCart()) {
            return;
        }

        $cart->shipping_rates()->delete();