packages/Webkul/Notification/src/Repositories/NotificationRepository.php

    public function getParamsData(array $params): array
    {
        $query = $this->model->whereNull('customer_id')->with(['order.items', 'order.customer']);

        // 1. Filter by category tab
        if (! empty($params['category']) && $params['category'] !== 'all') {
            $this->applyCategoryFilter($query, (string) $params['category']);
        } elseif (isset($params['status']) && $params['status'] !== 'all' && $params['status'] !== 'All') {
            $query->whereHas('order', function ($q) use ($params) {
                $q->where(['status' => $params['status']]);
            });
        }

        // 2. Read filter
        if (isset($params['read'])) {
            $query->where('read', (int) $params['read']);
        }

        $notifications = $query->latest('id')->paginate($params['limit'] ?? 10);
---
select * from `orders` where `orders`.`id` in (13)