packages/Webkul/Sales/src/Models/Order.php

select * from `addresses` where `addresses`.`order_id` = 13 and `addresses`.`order_id` is not null and `address_type` in ('order_billing', 'order_shipping')
---
    public function shipping_address()
    {
        return $this->addresses
            ->where('address_type', OrderAddress::ADDRESS_TYPE_SHIPPING);

select * from `orders` where `orders`.`id` = 13 limit 1
---
    public function canCancel(): bool
    {
        foreach ($this->items as $item) {
            if (
                $item->canCancel()
                && ! in_array($item->order->status, [
                    self::STATUS_CLOSED,
                    self::STATUS_FRAUD,
                ])
            ) {