packages/Webkul/Fulfillment/src/Http/Controllers/Admin/FulfillmentController.php

select count(*) as aggregate from `external_api_logs`
---
    public function monitoringIndex(Request $request)
    {
        if (! config('fulfillment.admin_ui_enabled', true)) {
            abort(403, 'Fulfillment Admin UI is disabled.');
        }

        // 1. Fetch Circuit Breaker Failures
        $failures = (int) \Illuminate\Support\Facades\Cache::get("circuit_breaker:aliexpress:failures", 0);
        $circuitState = $failures >= 5 ? 'OPEN' : 'CLOSED';

        // 2. Fetch Rate Limiting Calls
        $limitKey = "rate_limit:aliexpress:" . date('Y-m-d-H-i');
        $apiCalls = (int) \Illuminate\Support\Facades\Cache::get($limitKey, 0);

        // 3. Fetch Queue Backlog
        $queueBacklog = 0;
        try {
            $queueBacklog = DB::table('jobs')->count();
        } catch (\Exception $e) {
            // Table might not exist
        }

        // 4. Fetch Paginated External API Logs
        $apiLogs = DB::table('external_api_logs')
            ->orderBy('id', 'desc')
            ->paginate(15, ['*'], 'logs_page')
            ->withQueryString();